Домашняя_работа/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЮридическийАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПочтовыйАдрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Домашняя_работа/src/Enums/ЮридическоеФизическоеЛицо/ЮридическоеФизическоеЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЮридическоеФизическоеЛицо</name>
  <enumValues>
    <name>ЮридическоеЛицо</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

Домашняя_работа/src/Catalogs/Контрагенты/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка) 
	
	ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо; 
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЭтоЮридическоеЛицо = ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
	ДлинаИНН = СтрДлина(ИНН);
	ДлинаКПП = СтрДлина(КПП);
		
	Если ЭтоЮридическоеЛицо Тогда
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда  
			Отказ = Истина;
			Сообщить("Не заполнено поле ""ИНН""");
		Иначе
			Если ДлинаИНН <> 10 Тогда
				Отказ = Истина;
				Сообщить("Номер ИНН должен состоять из 10 цифр");
			Иначе 
				Если Не РаботаСИНН.ИННВерен(ИНН) Тогда
					Отказ = Истина;
					Сообщить("Контрольная сумма ИНН не совпадает");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;    
		
		Если НЕ ЗначениеЗаполнено(КПП) Тогда  
			Отказ = Истина;
			Сообщить("Не заполнено поле ""КПП""");
		Иначе
			Если ДлинаКПП <> 9 Тогда
				Отказ = Истина;
				Сообщить("Номер КПП должен состоять из 9 цифр");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если НЕ ЗначениеЗаполнено(ИНН) Тогда  
			Отказ = Истина;
			Сообщить("Не заполнено поле ""ИНН""");
		Иначе
			Если ДлинаИНН <> 12 Тогда
				Отказ = Истина;
				Сообщить("Номер ИНН должен состоять из 12 цифр");
			Иначе 
				Если Не РаботаСИНН.ИННВерен(ИНН) Тогда
					Отказ = Истина;
					Сообщить("Контрольная сумма ИНН не совпадает");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(КПП) Тогда    
			Отказ = Истина;
			Сообщить("Для физического лица поле ""КПП"" не должно быть заполнено");
		КонецЕсли;
	КонецЕсли;
	
	Цифры = "01234567890";
	Для Сч = 1 По ДлинаИНН Цикл
		Символ = Сред(ИНН, Сч, 1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Отказ = Истина; 
			Сообщить("Номер ИНН содержит недопустимые символы");  
			Прервать;
		КонецЕсли;  
	КонецЦикла;   
	
	Для Сч = 1 По ДлинаКПП Цикл
		Символ = Сред(КПП, Сч, 1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Отказ = Истина; 
			Сообщить("Номер КПП содержит недопустимые символы");  
			Прервать;
		КонецЕсли;  
	КонецЦикла;
	
КонецПроцедуры
